[
    {
        "pk": 1,
        "fields": {
            "title": "ADIG - Coffeeshop",
            "overviewDescription": "ADIG - Coffeeshop is a hybrid Django and React application designed for a coffeeshop co authored with Diarmaid Barron. The application is hosted on Heroku with data stored on a postgreSQL database on AWS RDS and the menu PDF stored on AWS S3. It provides an intuitive way for site owners to manage their content without needing to contact developers for minor changes.",
            "overviewImage": "adig-coffeeshop-overview.webp",
            "shortDescription": "ADIG - Coffeeshop is a hybrid Django and React application designed for a coffeeshop.",
            "featured": true,
            "mobileVersion": true,
            "date": "2024",
            "colorTheme": ["#8d016e","#494949", "#8d016e"],
            "technologies": ["HTML", "CSS", "JS", "Python", "Django", "PostgesSQL", "React", "AWS S3", "AWS RDS", "Heroku", "Bootstrap", "jQuery", "SQLite", "Google Maps API", "InstagFeed.js"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/coffee",
                    "https://adig-coffeeshop-e5122ea78847.herokuapp.com/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": {
                "link": [
                    "https://www.linkedin.com/in/diarmaidb/"
                ],
                "author": [
                    "Diarmaid Barron"
                ]
            },
            "fields": {
                "sectionTitle": [
                    "Home",
                    "Menu",
                    "Contact"
                ],
                "descriptions": [
                    "The Home page showcases a dynamic and engaging layout, beginning with a carousel that includes a personalized greeting message. Following the carousel, there is a banner that highlights key aspects of the business, offering visitors a quick overview of its unique offerings.\n\nEmbedded within the page is a Vimeo video, providing a visual and interactive representation of the brand, which is complemented by a live Instagram feed that keeps the page updated with the latest posts and content from the business's social media presence.\n\nAdditionally, the page features an About section, which includes an interactive Google Maps integration with a custom map marker, making it easy for users to locate the business. Together, these elements create a well-rounded and immersive experience for visitors, combining multimedia content with essential business information.",
                    "The Menu page allows users to view the business's menu in a convenient PDF format. This menu is uploaded directly by the site owner through Djangos Admin interface, providing flexibility for updates or changes. Once uploaded, the PDF is securely stored in an AWS S3 Bucket, ensuring reliability and scalability for file storage. This feature streamlines menu management, allowing the owner to keep their offerings up-to-date with ease, while also ensuring that visitors can access the latest version of the menu quickly and efficiently.",
                    "The Contact page is a simple form made purely in React with no backend as it is for display purposes only as may not be wanted for all owners."
                ],
                "images": [
                    "adig-coffeeshop-home.webp",
                    "adig-coffeeshop-menu.webp",
                    "adig-coffeeshop-contact.webp"
                ],
                "admin": [
                    false,
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "To create a customisable website for the owner to be able to change the content of the site themselves without need for developers unless they need big changes.",
                    "Integrating React and Django together.",
                    "Has greatly improved my React and Django skills and am happy with the final product."
                ]
            }
        }
    },
    {
        "pk": 2,
        "fields": {
            "title": "Ellas Design",
            "overviewDescription": "Ellas Design is a full stack Django web app to sell clothing from Ella Moya. The user can browse the products and add them to cart where they can checkout and pay using Stripe Payments. They can also create a profile to store their delivery information and see their order history. The owner is able to add, edit and delete products. The mobile display you can see below is only available on the Home, Shop, Product, About and Contact pages. You will get an error if you try to go to other pages for security reasons. Please go to the live website if you would like to make a purchase.",
            "overviewImage": "ellas_design_overview.webp",
            "shortDescription": "Ellas Design is a full stack Django web app to sell clothing from Ella Moya.",
            "featured": true,
            "mobileVersion": true,
            "date": "2020",
            "colorTheme": ["#f990bc","#494949", "#e7b5e4"],
            "technologies": ["HTML", "CSS", "JS", "Python", "Django", "PostgesSQL", "AWS S3", "Stripe Payments", "AWS RDS", "Heroku", "Bootstrap", "jQuery", "SQLite"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/Ellas_Design",
                    "https://ellas-design-231d819e785f.herokuapp.com/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": [
                    "Details",
                    "Home",
                    "Shop",
                    "Product",
                    "Bag",
                    "Checkout",
                    "Order Complete",
                    "Product Management",
                    "Create or Edit a Product",
                    "Profiles",
                    "Contact",
                    "About"
                ],
                "descriptions": [
                    "The site is designed for users to buy from the shop aswell as allowing the admin to add, edit, update and delete products. The site works on any screen size. Click Mobile Version below to see the mobile version of the site or Admin View to see what the admin sees on each page.",
                    "The home page consists of a background image and link to the shop. The image is a selection of fabrics that the client has developed.",
                    "The shop displays all of Ellas products on cards. Clicking on any card will bring to the products page. There is a nice flower animation playing on this page that I found online. Here the admin can also add new products.",
                    "The product page shows more detail on a specific product and allows the user to choose a quantity and add it to the Bag. Anything added to the bag shows as the price on the top right of the screen. As an admin you can edit or delete the product from here.",
                    "The bag can be seen at all times at the top right of the navigation. If you go to the bag you can see the items in your bag and add more of an item or remove items and prices will be reflected properly.",
                    "When the user goes to checkout they need to enter in their personal details as well as bank information. Right now it is using Stripe Test API so you can enter all 42 and it will proceed to order complete.",
                    "When order is done the order is displayed on the screen and the user gets a confirmation email along with their order details.",
                    "As an admin you can go on to the product management page where you can create new categories or new products.",
                    "On creating or editing a page you can add or change the image, give a title, description and SKU.",
                    "A user can create an account to store their delivery details as well as see their order history. Just simply click the profile at the top right of navigation and register.",
                    "The contact page has a form for users to get in touch with the client. When submitted it will sent an email to the client.",
                    "An about page with some links to the clients social media."
                ],
                "images": [
                    null,
                    "ellas_design_home.webp",
                    "ellas_design_shop.webp",
                    "ellas_design_product.webp",
                    "ellas_design_bag.webp",
                    "ellas_design_checkout.webp",
                    "ellas_design_order.webp",
                    "ellas_design_manage.webp",
                    "ellas_design_crud.webp",
                    "ellas_design_profile.webp",
                    "ellas_design_contact.webp",
                    "ellas_design_about.webp"
                ],
                "admin": [
                    false,
                    false,
                    false,
                    true,
                    false,
                    false,
                    false,
                    false,
                    false,
                    false,
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "To create a website for the client to sell her clothing as well as get in touch with the client.",
                    "Learning the Django framework as well as implementing Stripe and AWS S3.",
                    "I loved the process and think the Django framework has a lot of positives when developing and can see myself making something in the future with it."
                ]
            }
        }
    },
    {
        "pk": 3,
        "fields": {
            "title": "Lazy Hunger",
            "overviewDescription": "Lazy Hunger is a community based website for users to share their recipes with others. Using Flask with Python for the backend, Materialise CSS and jQuery for the frontend, and MongoDB for storage. Users can create, view, edit and delete recipes.",
            "overviewImage": "lazy_hunger_overview.webp",
            "shortDescription": "A community based website for users to share their recipes with others.",
            "featured": true,
            "mobileVersion": true,
            "date": "2020",
            "colorTheme": ["#cd0000","#494949", "#bd6367 "],
            "technologies": ["HTML", "CSS", "JS", "jQuery", "Python", "Flask", "MongoDB", "Materialise CSS"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/Lazy-Hunger",
                    "https://lazy-hunger-9742fb5be98d.herokuapp.com/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": [
                    "Home",
                    "Create a Recipe",
                    "View/Edit or Delete a Recipe"
                ],
                "descriptions": [
                    "On the home page you can find any recipes currently on the database. They can be deleted by others though, so grab the recipe while it is there.",
                    "Click to create a recipe and you can fill in all the details. Add some ingrediants and cooking methods with the plus buttons and add a personal image if you like.",
                    "Clicking on any recipe you can see the details and if you wish you can click to edit the recipe or delete if you dare let others miss out.. Maybe it should be missed. On edit the pages looks the page as creating a recipe but the details are already there for you to change. Editing a recipe you can change anything, the title, description, image or add or remove ingrediants or methods."
                ],
                "images": [
                    "lazy_hunger_home.webp",
                    "lazy_hunger_create.webp",
                    "lazy_hunger_view.webp"
                ],
                "admin": [
                    false,
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "Create a community based website for users to share their cooking recipes with others.",
                    "Using the Flask and Materialise frameworks as well as storing information on MongoDB.",
                    "Once I understood MongoDB stores its files like JSON and how to add, edit and delete data from the database it became a lot of fun to use."
                ]
            }
        }
    },
    {
        "pk": 4,
        "fields": {
            "title": "Find Ireland",
            "overviewDescription": "A tourism website to explore different tourist attractions across Ireland. The website is API heavy and uses JS and Jquery to create a website to see nearby tourist attractions to the selected towns.",
            "overviewImage": "find_ireland_overview.webp",
            "shortDescription": "A website to see tourist attractions around Ireland.",
            "featured": true,
            "mobileVersion": true,
            "date": "2020",
            "colorTheme": ["#1cba24","#49494921", "#bd6367 "],
            "technologies": ["HTML", "CSS", "JS", "Bootstrap", "Google Maps API", "Wikipedia API", "WeatherBit API"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/Find-Ireland",
                    "https://allengleeson.github.io/Find-Ireland/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": [
                    "API Used",
                    "Home",
                    "About"
                ],
                "descriptions": [
                    "I use google maps API and search for tourist attractions within 50miles of a location then I find an image and use Wikipedias API to gather information about that attraction. The about page also uses an Weather API to show the current temperature on the four sides of Ireland.",
                    "The home page has a nice image of Irelands countryside as well as the google map. Click on one of the city buttons or pictures on the map will zoom in to show markers for attractions in the area and will display cards below the map of any attraction it found near the location as well as information about the locations.",
                    "On the about page you can find more information about Ireland as well as a Carousel to display some nice images of the country. Down at the bottom of the page you will find the weather API working with todays current temperatures."
                ],
                "images": [
                    null,
                    "find_ireland.webp",
                    "find_ireland_about.webp"
                ],
                "admin": [
                    false,
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "To create a website using different API to create a interesting experience for the user to view and learn more about Ireland.",
                    "Trying out and using different API and getting bits of what I need from each to make something I want.",
                    "There is so much code out there that other coders like myself can use for their own projects and it leads to ideas of what can be done."
                ]
            }
        }
    },
    {
        "pk": 5,
        "fields": {
            "title": "AMG Art Gallery",
            "overviewDescription": "A gallery website for AMG to display her art, photos and poems created using HTML, CSS and Bootstrap.",
            "overviewImage": "amg_art_overview.webp",
            "shortDescription": "An art gallery for AMG to display some of their art, photos and poems.",
            "featured": true,
            "mobileVersion": true,
            "date": "2020",
            "colorTheme": ["#0a28af","#494949", "#bd6367 "],
            "technologies": ["HTML", "CSS", "Bootstrap"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/AmgArtGallery",
                    "https://allengleeson.github.io/AmgArtGallery/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": [
                    "Home",
                    "Gallery",
                    "Poems",
                    "Contact"
                ],
                "descriptions": [
                    "Home page consists of a jumbotron with an message from the artist and a Carousel to display some of their favourite images.",
                    "The gallery is three HTML pages navigated through a paginator. These pages are the gallery and display a collection of the artists art and photos.",
                    "The poems page displays two of the artists poems and images attached.",
                    "The contact page has another message from the artist as well as an image they like and an embedded YouTube video. Below there is a contact form that but no functionality as the site has no backend."
                ],
                "images": [
                    "amg_home.webp",
                    "amg_gallery.webp",
                    "amg_poems.webp",
                    "amg_contact.webp"
                ],
                "admin": [
                    false,
                    false,
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "Create a place for the client to display their art, photos and poems in a nice way.",
                    "Learning the Bootstrap framework and getting the hang of rows and columns.",
                    "Bootstrap has so much utility and can help to make a very structured website that works for all screen sizes."
                ]
            }
        }
    },
    {
        "pk": 6,
        "fields": {
            "title": "SSid Checker",
            "overviewDescription": "Application that enables a user to check if the user name of your WiFi network, which is identified as SSID (Service Set Identifier) hereafter is of a standard format that conforms to the rules corresponding to the assigned item. The application prompts the user to provide one item (i.e. a piece of text). Next, the application uses the piece of text to determine if the provided text is valid or invalid.",
            "overviewImage": null,
            "shortDescription": "Application to validate user name of Wifi Network.",
            "featured": false,
            "mobileVersion": false,
            "date": "2023",
            "colorTheme": ["#ffc83c","#494949", "#bd6367 "],
            "technologies": ["Java"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/SSidChecker---NCI"
                ],
                "linkName": [
                    "GitHub"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": [
                    "Flow",
                    "Validation"
                ],
                "descriptions": [
                    "Ask the user at the beginning of the application how many items they would like to check, and ensure that the application enables the user to provide that amount of items and for each item check its validity.",
                    "To there are a few rules to validate the SSiD. It starts with five-digit sequence number (i.e. SSSSS-LLL CC) in descending order. Continues with a dash followed by three letters unique to the service provider Eir. Continues with a space and ends with a two-character sequence. The first character of the two-character sequence should be a digit followed by a letter randomly selected from English alphabet. A digit is any of the ten numbers from 0 to 9. Further, the digits should be unique in the five-digit sequence."
                ],
                "images": [
                    null,
                    null
                ],
                "admin": [
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "Validate as many SSiD's as a user wants and generate passwords.",
                    "Short time constraint was the main challenge to this. Messing around with substring and split also.",
                    "Was a interesting application to make and great to be using Java again."
                ]
            }
        }
    },
    {
        "pk": 7,
        "fields": {
            "title": "Random Trip",
            "overviewDescription": "Simple page using CSS grid and semantic HTML elements to create a page for users to sign up to a random holiday destination.",
            "overviewImage": "random_trip.webp",
            "shortDescription": "Simple page using CSS grid and semantic HTML elements to create a page for users to sign up to a random holiday destination.",
            "featured": false,
            "mobileVersion": false,
            "date": "2022",
            "colorTheme": ["#810000","#494949", "#bd6367 "],
            "technologies": ["HTML", "CSS"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/RandomTrip",
                    "https://allengleeson.github.io/RandomTrip/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": null,
                "descriptions": null,
                "images": null,
                "admin": null
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "The purpose of the website was to practice using CSS's Grid to style elements as well as use and understand semantic HTML elements.",
                    "Using CSS's grid system was interesting to learn about.",
                    "I see a lot of use in using semantic elements and am trying to keep to that for future projects."
                ]
            }
        }
    },
    {
        "pk": 8,
        "fields": {
            "title": "Library",
            "overviewDescription": "A simple library application. Allows users to add and book and mark if it was read or not as well as delete the book. User can add a new book by clicking Add Book and enter the name. Then mark if it was read or not. After the book is added the user can delete the book if they wish.",
            "overviewImage": null,
            "shortDescription": "A simple library application. Allows users to add and book and mark if it was read or not as well as delete the book.",
            "featured": false,
            "mobileVersion": true,
            "date": "2022",
            "colorTheme": ["#ffc83c","#00294c", "#bd6367 "],
            "technologies": ["HTML", "CSS", "JS"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/LibraryAssignment",
                    "https://allengleeson.github.io/LibraryAssignment/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": null,
                "descriptions": null,
                "images": null,
                "admin": null
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "Practice making something small with HTML, CSS, JS.",
                    "No challenges on this one. Fairly straight forward.",
                    "More practice with CRUD functionality."
                ]
            }
        }
    },
    {
        "pk": 9,
        "fields": {
            "title": "Review Scrapper",
            "overviewDescription": "A Webscraper using Selenium to gather data from a given company and some reviews and store them in an excel file and on MongoDB. It searches trustpilot.com for the company you search and gathers reviews and general company data to put in our file or database.",
            "overviewImage": null,
            "shortDescription": "A Webscraper using Selenium to gather data from a given company and some reviews and store them in an excel file and on MongoDB.",
            "featured": false,
            "mobileVersion": false,
            "date": "2022",
            "colorTheme": ["#ffc83c","#00294c", "#bd6367 "],
            "technologies": ["Python", "Selenium", "MongoDB", "Excel"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/reviewscrapper"
                ],
                "linkName": [
                    "GitHub"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": [
                    "Excel",
                    "MongoDB"
                ],
                "descriptions": [
                    "Once data is scrapped I then use xlsxwriter to save it on to an Excel file.",
                    "Connection made to MongoDB and data is sent there at same time as writing to excel file."
                ],
                "images": [
                    "review_scrapper_excel.jpg.webp",
                    "reviewscraper_mongo.webp"
                ],
                "admin": [
                    false,
                    false
                ]
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "Create a webscrapper to gather company data and store it in excel and in MongoDB.",
                    "First time creating a webscrapper and while I have tried selenium before I hadnt used it to do web scrapping.",
                    "Was very interesting to work on and I have since began doing more web scrapping for Orcawise. Now I have to deal with other things that can hinder web scrapping like being blocked depending on the website. Leads finding a way around the problem."
                ]
            }
        }
    },
    {
        "pk": 10,
        "fields": {
            "title": "CSS Presentation",
            "overviewDescription": "A CSS presentation to get a better grasp of the fundamentals and Flex box.",
            "overviewImage": "css_presentation.webp",
            "shortDescription": "A CSS presentation to get a better grasp of the fundamentals and Flex box.",
            "featured": false,
            "mobileVersion": false,
            "date": "2022",
            "colorTheme": ["#ffc83c","#00294c", "#bd6367 "],
            "technologies": ["HTML", "CSS"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/css-presentation",
                    "https://allengleeson.github.io/css-presentation/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": null,
                "descriptions": null,
                "images": null,
                "admin": null
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "To better learn Flexbox and how to get elements where I want them.",
                    "Getting used to how Flexbox works.",
                    "I enjoy using Flexbox and can see myself using it in certain situations especially if you cant use a CSS framework like Bootstrap or Materialise CSS which have thier own grid and column system."
                ]
            }
        }
    },
    {
        "pk": 11,
        "fields": {
            "title": "JS Presentation - Part One",
            "overviewDescription": "A JS presentation to get a better grasp of the fundamentals. Creating a simple Rock, Paper, Scissors game. User is asked for input when on the page and they can enter in their choice as text.",
            "overviewImage": "js_presentation_1_overview.webp",
            "shortDescription": "A JS presentation to get a better grasp of the fundamentals.",
            "featured": false,
            "mobileVersion": false,
            "date": "2022",
            "colorTheme": ["#ffc83c","#00294c", "#bd6367 "],
            "technologies": ["HTML", "CSS", "JS"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/js-presentation",
                    "https://allengleeson.github.io/js-presentation/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": null,
                "descriptions": null,
                "images": null,
                "admin": null
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "Practice JS more.",
                    "No challenges.",
                    "Simple enough application, just something else to practice on."
                ]
            }
        }
    },
    {
        "pk": 12,
        "fields": {
            "title": "JS Presentation - Part Two",
            "overviewDescription": "More practice with frontend fundamentals this time creating a calculator. Combining CS flexbox with some more JS practice.",
            "overviewImage": "js_presentation_2_overview.webp",
            "shortDescription": "More practice with frontend fundamentals this time creating a calculator.",
            "featured": false,
            "mobileVersion": false,
            "date": "2022",
            "colorTheme": ["#ffc83c","#00294c", "#bd6367 "],
            "technologies": ["HTML", "CSS", "JS"],
            "links": {
                "link": [
                    "https://github.com/AllenGleeson/js-presentation-part-2",
                    "https://allengleeson.github.io/js-presentation-part-2/"
                ],
                "linkName": [
                    "GitHub",
                    "Live Site"
                ]
            },
            "coauthors": null,
            "fields": {
                "sectionTitle": null,
                "descriptions": null,
                "images": null,
                "admin": null
            },
            "endDescriptions": {
                "titles": [
                    "Goal",
                    "Challenges",
                    "Final Thoughts"
                ],
                "descriptions": [
                    "To combine and practice with Flexbox and JS.",
                    "Still getting used to flexbox and how it interacts with elements.",
                    "Overall doing the CSS and Js presentations helped me think more about how I'm making websites and who will be using them as well as flexbox and when to use it."
                ]
            }
        }
    }
]